In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("Mall_Customers.csv")
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [3]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [4]:
df.columns = ['CustomerID', 'Gender', 'Age', 'Income', 'SpendingScore']
df.head()

   CustomerID  Gender  Age  Income  SpendingScore
0           1    Male   19      15             39
1           2    Male   21      15             81
2           3  Female   20      16              6
3           4  Female   23      16             77
4           5  Female   31      17             40

In [10]:
df['Income_Group'] = pd.cut(
    df['Income'],
    bins=[0, 40, 70, 150],
    labels=['Low Income', 'Medium Income', 'High Income']
)
df['Income_Group']

0       Low Income
1       Low Income
2       Low Income
3       Low Income
4       Low Income
          ...
195    High Income
196    High Income
197    High Income
198    High Income
199    High Income
Name: Income_Group, Length: 200, dtype: category
Categories (3, object): ['Low Income' < 'Medium Income' < 'High Income']

In [13]:
df['Spending_Group'] = pd.cut(
    df['SpendingScore'],
    bins=[0, 40, 70, 100],
    labels=['Low Spender', 'Medium Spender', 'High Spender']
)
df['Spending_Group']

0       Low Spender
1      High Spender
2       Low Spender
3      High Spender
4       Low Spender
           ...
195    High Spender
196     Low Spender
197    High Spender
198     Low Spender
199    High Spender
Name: Spending_Group, Length: 200, dtype: category
Categories (3, object): ['Low Spender' < 'Medium Spender' < 'High Spender']

In [9]:
segment_summary = df.groupby(
    ['Income_Group', 'Spending_Group'],
    observed=False
).agg(
    Customers=('CustomerID', 'count'),
    Avg_Age=('Age', 'mean'),
    Avg_Spending=('SpendingScore', 'mean')
).reset_index()
segment_summary

    Income_Group  Spending_Group  Customers    Avg_Age  Avg_Spending
0     Low Income     Low Spender         23  45.217391     20.913043
1     Low Income  Medium Spender          8  30.875000     54.875000
2     Low Income    High Spender         19  25.105263     81.789474
3  Medium Income     Low Spender          3  33.666667     36.333333
4  Medium Income  Medium Spender         71  43.915493     50.352113
5  Medium Income    High Spender          2  35.000000     84.000000
6    High Income     Low Spender         37  40.864865     18.351351
7    High Income  Medium Spender          4  29.750000     67.250000
8    High Income    High Spender         33  32.909091     83.818182

In [14]:
df.to_csv("segmented_customers.csv", index=False)
segment_summary.to_csv("segment_summary.csv", index=False)

In [15]:
df

,CustomerID,Gender,Age,Income,SpendingScore,Income_Group,Spending_Group
0,1,Male,19,15,39,Low Income,Low Spender
1,2,Male,21,15,81,Low Income,High Spender
2,3,Female,20,16,6,Low Income,Low Spender
3,4,Female,23,16,77,Low Income,High Spender
4,5,Female,31,17,40,Low Income,Low Spender
...,...,...,...,...,...,...,...
195,196,Female,35,120,79,High Income,High Spender
196,197,Female,45,126,28,High Income,Low Spender
197,198,Male,32,126,74,High Income,High Spender
198,199,Male,32,137,18,High Income,Low Spender
199,200,Male,30,137,83,High Income,High Spender